{
  "metadata": {
    "fetch_date": "2026-01-26T11:32:49.559840",
    "query": "top news stories from India today",
    "location": "Global",
    "total_articles": 5,
    "news_type": "serious"
  },
  "articles": [
    {
      "headline": "H‑1B Visa Interview Slots in India Pushed to 2027",
      "summary": "All five US consulates in India have deferred H‑1B visa stamping interview slots to 2027, citing new social media vetting requirements. This leaves many Indian professionals in limbo.",
      "detailed_summary": "• No H‑1B visa stamping interviews are available in India for the remainder of 2026\n• All five US consulates in India have pushed interview dates to 2027\n• The delay is attributed to enhanced social media vetting protocols\n• The change affects Indian professionals planning to travel to the US for work\n• The move has sparked concerns about career disruptions and immigration backlog",
      "why_it_matters": "If you’ve been dreaming of that Silicon Valley gig or a US-based tech career, this is your cue to panic—politely. The delay could mean career detours, postponed relocations, and a lot more chai-fueled Zoom interviews from home.",
      "context": "H‑1B Visa: A non-immigrant visa allowing US companies to employ foreign workers in specialty occupations. It’s highly sought after by Indian professionals in tech and academia. The process includes petition approval and a visa stamping interview at a US consulate.  \n   Social Media Vetting: A security measure where visa applicants’ social media profiles are reviewed to assess potential risks. It has become increasingly stringent, leading to delays and additional scrutiny.",
      "sentiment": "Negative",
      "source": "https://timesofindia.indiatimes.com/india/interview-slots-for-h-1b-visas-now-only-in-2027/articleshow/127503949.cms"
    },
    {
      "headline": "Former BCCI President IS Bindra Passes Away at 84",
      "summary": "Inderjit Singh Bindra, former president of the BCCI and a key figure in modernising cricket marketing in India, has passed away at the age of 84.",
      "detailed_summary": "• IS Bindra died on 25 January 2026 at the age of 84\n• He served as president of the Board of Control for Cricket in India (BCCI)\n• Credited with ushering in a new era of cricket marketing in India\n• His tenure saw increased commercialisation and global visibility of Indian cricket\n• His death marks the end of an influential chapter in Indian cricket administration",
      "why_it_matters": "For anyone who’s ever cheered for Team India or wondered why cricket suddenly started paying the bills, this is the farewell of the man who turned cricket into a Bollywood-sized business.",
      "context": "BCCI: The Board of Control for Cricket in India is the governing body for cricket in India. It oversees domestic and international cricket, and is one of the wealthiest and most powerful cricket boards globally.  \n   Cricket Marketing in India: The commercial transformation of cricket in India began in the late 20th century, with television rights, sponsorships, and the advent of the Indian Premier League (IPL), turning cricket into a multi-billion-dollar industry.",
      "sentiment": "Neutral",
      "source": "https://economictimes.indiatimes.com/news/newsblogs/india-world-breaking-news-updates-weather-rain-snow-air-quality-kerala-tamil-nadu-west-bengal-assam-assembly-elections-bjp-pm-modi-congress-rahul-gandhi-donald-trump-tariffs-global-trade/liveblog/127443070.cms"
    },
    {
      "headline": "Padma Awards 2026 Announced; Shubhanshu Receives Ashoka Chakra",
      "summary": "On the eve of Republic Day, the 2026 Padma Awards were announced. Among the gallantry honours, Shubhanshu Shukla received the Ashoka Chakra, and Colonel Sophia was awarded the Vishisht Seva Medal.",
      "detailed_summary": "• Padma Awards 2026 were announced on 25 January 2026\n• Shubhanshu Shukla was honoured with the Ashoka Chakra\n• Colonel Sophia received the Vishisht Seva Medal\n• Several other gallantry awardees and civilians were also recognised\n• Awards were announced ahead of Republic Day celebrations",
      "why_it_matters": "Think of it as India’s Oscars for bravery and service—only with fewer red carpets and more medals. If you know someone who’s quietly heroic, this is your reminder that the nation notices.",
      "context": "Padma Awards: One of India’s highest civilian honours, including Padma Vibhushan, Padma Bhushan, and Padma Shri. Gallantry awards like the Ashoka Chakra and Vishisht Seva Medal recognise bravery and distinguished service.  \n   Ashoka Chakra: India’s highest peacetime gallantry award, given for valor, courageous action, or self-sacrifice away from the battlefield.",
      "sentiment": "Positive",
      "source": "https://www.amarujala.com/india-news/top-headline-today-important-and-big-news-stories-of-26th-january-2026-updates-on-amar-ujala-2026-01-26?src=news-briefs"
    },
    {
      "headline": "India–New Zealand Free Trade Agreement Nears Conclusion",
      "summary": "India and New Zealand are close to finalising a Free Trade Agreement (FTA) that promises zero-duty access for Indian exports and a $20 billion FDI commitment over 15 years.",
      "detailed_summary": "• India and New Zealand are concluding a Free Trade Agreement\n• The FTA includes zero-duty access for Indian exports to New Zealand\n• New Zealand will invest $20 billion in India over the next 15 years\n• The deal is expected to benefit farmers, MSMEs, artisans, women-led enterprises, and youth\n• This marks India’s 18th FTA and is likely to be signed soon and come into force in 2026",
      "why_it_matters": "If you’re selling mangoes, making artisanal soaps, or just hoping for cheaper imports, this is your golden ticket. It’s like India and New Zealand decided to go halves on a trade party—and you’re invited.",
      "context": "Free Trade Agreement (FTA): A pact between countries to reduce or eliminate tariffs, import quotas, and preferences on most goods and services traded between them. FTAs aim to boost trade and economic cooperation.  \n   FDI (Foreign Direct Investment): Investment from one country into business interests in another, such as establishing operations or acquiring assets. FDI brings capital, technology, and employment.",
      "sentiment": "Positive",
      "source": "https://economictimes.indiatimes.com/news/india-news/india-new-zealand-conclude-2nd-round-of-fta-talks-achieve-progress-on-trade-investment-economic-cooperation/articleshow/127443070.cms"
    },
    {
      "headline": "Gold and Silver Prices Hold Steady on Republic Day",
      "summary": "On 26 January 2026, gold and silver prices in India remained steady, with MCX gold trading at ₹1.61 lakh per 10 grams and silver near ₹3.35 lakh per kilogram.",
      "detailed_summary": "• MCX gold price is ₹1.61 lakh per 10 grams as of 26 January 2026\n• Silver is trading near ₹3.35 lakh per kilogram\n• Prices have remained steady following recent highs\n• City-wise rates are available for Delhi, Mumbai, and other metros\n• The stability comes amid Republic Day festivities and market caution",
      "why_it_matters": "For anyone who’s ever wondered if gold is still a better investment than your last mutual fund, this is your daily price check. It’s like checking the weather—only shinier and more expensive.",
      "context": "MCX Gold and Silver Prices: Commodity prices for precious metals traded on India’s Multi Commodity Exchange (MCX). These rates influence investment decisions, jewelry pricing, and economic sentiment.  \n   Precious Metals as Investment: Gold and silver are traditional hedges against inflation and currency fluctuations. In India, they also carry cultural significance and are often purchased during festivals and weddings.",
      "sentiment": "Neutral",
      "source": "https://sundayguardianlive.com/india/gold-silver-price-today-26-january-2026-mcx-gold-161-lakh-per-10g-silver-near-335-lakh-per-kg-check-city-wise-rates-delhi-mumbai-166493/"
    }
  ]
}