{
  "metadata": {
    "fetch_date": "2026-01-24T11:00:56.365310",
    "query": "top news stories from India today",
    "location": "Global",
    "total_articles": 5,
    "news_type": "serious"
  },
  "articles": [
    {
      "headline": "India de-licenses lower 6 GHz spectrum for Wi‑Fi services",
      "summary": "The Indian government has de-licensed the lower 6 GHz band (5925–6425 MHz) to boost Wi‑Fi 6E and Wi‑Fi 7 deployment. The move, effective January 21, 2026, is expected to enhance wireless connectivity across the country.",
      "detailed_summary": "• The Department of Telecommunications de-licensed the 5925–6425 MHz frequency band\n• The change took effect from January 21, 2026 under the Low Power and Very Low Power Wireless Access System Rules, 2026\n• This enables widespread use of Wi‑Fi 6E and Wi‑Fi 7 technologies in India\n• The upper 6 GHz band (6425–7125 MHz) remains reserved for advanced mobile services under NFAP\n• The decision is aimed at improving wireless internet speeds and capacity nationwide",
      "why_it_matters": "Faster Wi‑Fi means fewer buffering tantrums during your Netflix binges or Zoom calls. For the 20–50 crowd in Kolkata, this could mean smoother work-from-home days and less rage at slow internet.",
      "context": null,
      "sentiment": "Positive",
      "source": "https://affairscloud.com/current-affairs-24-january-2026/"
    },
    {
      "headline": "Lucknow achieves 100% scientific processing of municipal solid waste under SBM‑Urban",
      "summary": "Lucknow has become the first city in Uttar Pradesh to achieve 100% scientific processing of municipal solid waste under the Swachh Bharat Mission–Urban. The new facility, along with existing ones, processes over 2,100 MT of waste daily.",
      "detailed_summary": "• Lucknow inaugurated its third fresh waste processing facility at Shivari\n• Combined with two existing plants, the city now processes over 2,100 metric tonnes of waste per day\n• Out of 18.5 lakh MT of waste, approximately 12.86 lakh MT has been scientifically processed\n• The processed output includes 2.27 lakh MT of RDF, 4.38 lakh MT of inert material, 0.59 lakh MT of bio‑soil, and 2.35 lakh MT of C&D waste\n• Plans are underway to set up a 15 MW waste-to-energy plant at Shivari to convert RDF into electricity",
      "why_it_matters": "Clean streets, less stink, and maybe even power from your trash—Lucknow’s waste wizardry could inspire Kolkata to stop treating garbage like a surprise party no one asked for.",
      "context": null,
      "sentiment": "Positive",
      "source": "https://affairscloud.com/current-affairs-24-january-2026/"
    },
    {
      "headline": "Razorpay POS secures RBI Payment Aggregator – Physical licence",
      "summary": "Razorpay POS has received the RBI’s Payment Aggregator–Physical (PA‑P) licence, enabling it to handle in-store transactions across India. With this, Razorpay now holds all three key PA licences—online, physical, and cross-border.",
      "detailed_summary": "• Razorpay POS obtained the PA‑P licence from the Reserve Bank of India\n• The licence allows it to operate as an authorised payment aggregator for physical, in-store transactions\n• Razorpay now holds all three PA licences: PA‑O (online), PA‑P (physical), and PA‑CB (cross‑border)\n• The company offers hardware like Android Smart POS, mPOS, and soundbox devices\n• This positions Razorpay as one of the few fintech firms fully authorised across India’s payments ecosystem",
      "why_it_matters": "More payment options at your local chaiwala or kirana store—Razorpay’s licence means smoother, less awkward card swipes and fewer “card declined” horror stories.",
      "context": null,
      "sentiment": "Positive",
      "source": "https://affairscloud.com/current-affairs-24-january-2026/"
    },
    {
      "headline": "PM Modi to distribute over 61,000 appointment letters via video conference at 18th employment fair",
      "summary": "Prime Minister Narendra Modi will distribute more than 61,000 appointment letters to newly recruited youth across government departments via video conference at the 18th employment fair. The event is scheduled for today at 11 AM.",
      "detailed_summary": "• PM Modi will host a video conference at 11 AM today for the 18th employment fair\n• Over 61,000 appointment letters will be handed out to newly recruited individuals\n• Recipients span various government departments and organisations\n• The PM will also address a public gathering during the event\n• The initiative aims to boost youth employment and government recruitment transparency",
      "why_it_matters": "If you’ve ever dreamed of a government job—or just enjoy seeing others get lucky—today’s letter shower might make you feel like you missed the memo, or maybe it’ll inspire you to chase that dream.",
      "context": null,
      "sentiment": "Positive",
      "source": "https://www.tv9hindi.com/india/aaj-ki-taaja-khabar-live-updates-latest-news-hindi-samachar-daily-breaking-24-january-2026-3660653.html"
    },
    {
      "headline": "Top Maoist leader killed along with nine others in Jharkhand encounter",
      "summary": "A top Maoist leader with a ₹1 crore bounty was killed in an encounter in Jharkhand’s Saranda forest, along with nine others. The incident marks a significant blow to the insurgency in the region.",
      "detailed_summary": "• The encounter occurred in Saranda forest, Jharkhand\n• A top Maoist leader, wanted with a ₹1 crore bounty, was killed\n• Nine others were also killed in the operation\n• The incident is part of ongoing anti-Maoist efforts in the region\n• The operation underscores intensified security focus on insurgent strongholds",
      "why_it_matters": "For those in Kolkata and beyond, it’s a reminder that the fight against insurgency isn’t just a remote headline—it’s about national security, safer rail routes, and fewer “unexpected delays” on your weekend getaway.",
      "context": null,
      "sentiment": "Neutral",
      "source": "https://currentaffairs.freejobalert.com/article/school-assembly-news-headlines-today-24th-january-2026-top-national-world-sports-and-business-news-100649"
    }
  ]
}