{
  "metadata": {
    "fetch_date": "2026-01-24T08:45:02.053837",
    "query": "top news stories from Kolkata and Bengal today",
    "location": "Kolkata",
    "total_articles": 10
  },
  "articles": [
    {
      "headline": "Winter windfall for city eateries as Jan footfall smashes last yr's record",
      "summary": "Kolkata’s food and beverage sector saw a 10% increase in footfall in January compared to the previous year. The rise is driven by cold weather and the extended festive period. Popular restaurants on Park Street and specialty venues reported higher patronage and special events.",
      "detailed_summary": "• January footfall up ~10% year-on-year\n• Specialty Restaurants saw a 5% rise in business\n• Park Street venues like Mocambo, Peter Cat, Kwality had long queues\n• Restaurants such as Oudh 1590, Mezzuna, Mainland China hosted kebab festivals and curated menus\n• Cold weather and festive mood contributed to increased dining out",
      "why_it_matters": "The surge benefits restaurant workers, suppliers, and the hospitality sector, offering more job opportunities and economic activity. For residents, it means more dining options and festive experiences.",
      "context": null,
      "sentiment": "Positive",
      "source": "https://timesofindia.indiatimes.com/city/kolkata/winter-windfall-for-city-eateries-as-jan-footfall-smashes-last-yrs-record/articleshow/127320599.cms"
    },
    {
      "headline": "Wife files FIR after seeing Hiraan's '2nd wedding' pics",
      "summary": "BJP MLA and actor Hiraan Chatterjee faces an FIR filed by his wife, accusing him of cruelty and entering a second marriage without divorce. The complaint was lodged after photos of the alleged second wedding surfaced online. Police have begun investigating.",
      "detailed_summary": "• FIR filed at Anandapur Police Station under Bharatiya Nyaya Sanhita\n• Wife Anindita Chattopadhyay alleges mental and physical cruelty and bigamy\n• Photos of second wedding with model Rittika Giri in Varanasi triggered the complaint\n• Anindita claims marriage since December 11, 2000, with no separation or divorce\n• Rittika denied wrongdoing, claimed a five-year relationship and that divorce notice was served\n• Police investigation underway; no arrests yet",
      "why_it_matters": "The case highlights legal and social issues around marriage, gender rights, and public accountability. It may influence public discourse on personal conduct of elected representatives.",
      "context": "Bharatiya Nyaya Sanhita – India’s new criminal code replacing the Indian Penal Code, Criminal Procedure Code, and Evidence Act, aiming to modernize and consolidate criminal laws.",
      "sentiment": "Negative",
      "source": "https://timesofindia.indiatimes.com/city/kolkata/wife-files-fir-after-seeing-hiraans-2nd-wedding-pics/articleshow/127316596.cms"
    },
    {
      "headline": "Mobile apps to expand breast cancer outreach and care launched in Kolkata",
      "summary": "The Institute of Breast Disease in Kolkata launched two mobile apps to enhance breast cancer awareness, early detection, and treatment adherence. The initiative aims to reach a broader population and improve healthcare accessibility.",
      "detailed_summary": "• Two mobile applications launched by Institute of Breast Disease (IBD)\n• Apps focus on awareness, early detection, and treatment adherence\n• Launched by Dr. Swapan Saren, Director of Health Services, West Bengal\n• Principal Secretary (Education) Binod Kumar present at the event\n• Initiative marks technological advancement in public health outreach",
      "why_it_matters": "These apps can empower women across Bengal with health information, early screening, and treatment support—potentially saving lives and reducing healthcare disparities.",
      "context": null,
      "sentiment": "Positive",
      "source": "https://timesofindia.indiatimes.com/city/kolkata/mobile-apps-to-expand-breast-cancer-outreach-and-care-launched-in-kolkata/articleshow/127269387.cms"
    },
    {
      "headline": "'Open creche at HC in 30 days'",
      "summary": "The Calcutta High Court has ordered its registry to operationalize a long-pending crèche within 30 days. The facility, ready since 2019, will serve court employees and advocates, with staffing and safety measures mandated.",
      "detailed_summary": "• Court directed to open crèche within 30 days\n• Service guidelines to be published online within three weeks\n• PWD to install aluminium grilles within two weeks\n• State government to assign two doctors and a nurse before opening\n• Crèche planned since 2019; paediatric and nursing posts sanctioned in August 2021",
      "why_it_matters": "The crèche will support working parents in the legal community, promoting work-life balance and childcare access. It reflects broader progress toward family-friendly public institutions.",
      "context": null,
      "sentiment": "Positive",
      "source": "https://timesofindia.indiatimes.com/city/kolkata/open-creche-at-hc-in-30-days/articleshow/127188248.cms"
    },
    {
      "headline": "Adjourn West Bengal SIR hearing, file FIR if attacked: CEO",
      "summary": "The West Bengal Chief Electoral Officer has instructed district officials to ensure law and order during Special Summary Revision (SIR) hearings. FIRs must be filed immediately if any threats or attacks occur.",
      "detailed_summary": "• CEO directed district magistrates and election officers to maintain peace during SIR hearings\n• FIRs to be filed immediately if public property is damaged or officials attacked\n• Instructions apply to hearings at panchayat, block, and ward offices\n• Aimed at safeguarding sensitive electoral processes\n• Emphasis on proactive law enforcement during revision process",
      "why_it_matters": "Ensuring safe and fair electoral roll revisions is critical for democratic participation. It reassures citizens about the integrity of the process and protects officials and voters.",
      "context": "Special Summary Revision (SIR) – A process by the Election Commission to update electoral rolls, removing ineligible names and adding new voters ahead of elections.",
      "sentiment": "Neutral",
      "source": "https://timesofindia.indiatimes.com/india/adjourn-wb-sir-hearing-file-fir-if-attacked-ceo/articleshow/127335819.cms"
    },
    {
      "headline": "Didi: If Netaji were alive, even he would've been called for hearing",
      "summary": "CM Mamata Banerjee criticized the SIR process, saying even Netaji Subhas Chandra Bose would be summoned today. She accused the Centre of deleting nearly 2 crore names from electoral rolls, disproportionately affecting vulnerable groups.",
      "detailed_summary": "• Made remarks during Netaji Jayanti event in Kolkata\n• Claimed even national icons would face SIR summons today\n• Alleged deletion of nearly 2 crore names from Bengal’s electoral roll\n• Said women, tribal communities, and elderly disproportionately affected\n• Cited emotional toll including suicides; called for accountability and resistance",
      "why_it_matters": "The comments reflect deep political tensions and raise concerns about voter disenfranchisement. For citizens, it underscores the importance of vigilance in protecting electoral rights.",
      "context": null,
      "sentiment": "Negative",
      "source": "https://timesofindia.indiatimes.com/city/kolkata/didi-if-netaji-were-alive-even-he-wouldve-been-called-for-hearing/articleshow/127320621.cms"
    },
    {
      "headline": "2 Bengal migrant workers found dead in AP, Kerala",
      "summary": "Two migrant workers from West Bengal were found dead in Andhra Pradesh and near Chennai within 24 hours. Families allege foul play and demand thorough investigations.",
      "detailed_summary": "• Manjur Alam Laskar (32) from South 24 Parganas found dead in Andhra Pradesh after ransom call demanding ₹25,000; family paid ₹6,000\n• Family alleges he was targeted for being Bengali-speaking Muslim\n• Alamgir Alam (29) from Malda found dead near Chennai railway track; last contacted wife on January 14\n• Both families suspect murder and demand full investigations\n• Incidents occurred within a 24-hour span in separate states",
      "why_it_matters": "The deaths highlight migrant worker vulnerabilities and safety concerns outside Bengal. It underscores the need for better protection and support systems for migrant laborers.",
      "context": null,
      "sentiment": "Negative",
      "source": "https://timesofindia.indiatimes.com/city/kolkata/2-bengal-migrant-workers-found-dead-in-ap-kerala/articleshow/127191972.cms"
    },
    {
      "headline": "Bengal SIR: EC orders FIRs against negligent BLOs, warns DEOs on law and order",
      "summary": "The Election Commission has directed FIRs against negligent Booth Level Officers during the SIR process and warned District Election Officers to maintain law and order.",
      "detailed_summary": "• EC mandates FIRs against negligent BLOs across states including West Bengal\n• DEOs warned to ensure law and order during SIR\n• Aimed at ensuring transparency and accountability in electoral roll revision\n• Applies to all regions undergoing SIR\n• Reinforces legal consequences for administrative lapses",
      "why_it_matters": "It reinforces electoral accountability and ensures officials are held responsible, protecting voter rights and the integrity of the process.",
      "context": "Booth Level Officers (BLOs) – Grassroots officials responsible for maintaining accurate voter lists; District Election Officers (DEOs) oversee election administration at district level.",
      "sentiment": "Neutral",
      "source": "https://m.economictimes.com/news/elections/assembly-elections/west-bengal/bengal-sir-ec-orders-firs-against-negligent-blos-warns-deos-on-law-and-order/articleshow/127309302.cms"
    },
    {
      "headline": "ED chief Rahul Navin reviews Bengal probes, I-PAC coal case in focus",
      "summary": "ED Director Rahul Navin visited Kolkata to review ongoing investigations, with a focus on the I-PAC coal smuggling case. The visit signals heightened scrutiny of financial corruption in the region.",
      "detailed_summary": "• Rahul Navin, ED Director, visited Kolkata on Friday\n• Reviewed progress of multiple investigations in West Bengal\n• Focus on I-PAC’s alleged involvement in coal smuggling\n• Meetings held with senior officials to assess probe status\n• Reflects increased enforcement activity in the state",
      "why_it_matters": "The probe may impact political funding and governance transparency. For citizens, it signals accountability and may influence future political and economic landscapes.",
      "context": "I-PAC (Indian Political Action Committee) – A political consultancy firm involved in campaign strategy; has faced scrutiny over alleged involvement in coal smuggling and financial irregularities.",
      "sentiment": "Neutral",
      "source": "https://m.economictimes.com/news/india/ed-chief-rahul-navin-reviews-bengal-probes-i-pac-coal-case-in-focus/articleshow/127317906.cms"
    },
    {
      "headline": "Bharti Airtel boosts network connectivity on Vidyasagar Setu",
      "summary": "Bharti Airtel enhanced mobile connectivity on Vidyasagar Setu by laying 1.3 km of fiber optic cable and installing antennas on six poles. This aims to improve communication for commuters and emergency services.",
      "detailed_summary": "• Installed 1.3 km fiber optic cable along Vidyasagar Setu\n• Network antennas placed on six poles across the bridge\n• Collaboration with PWD, West Bengal Police Traffic Department, HRBC\n• Airtel installed over 5,250 new network sites across Bengal in past three years\n• Aims to ensure uninterrupted connectivity for commuters and safety services",
      "why_it_matters": "Improved connectivity enhances commuter convenience, emergency response, and daily communication for residents traveling between Kolkata and Howrah.",
      "context": null,
      "sentiment": "Positive",
      "source": "https://timesofindia.indiatimes.com/city/kolkata/bharti-airtel-boosts-network-connectivity-on-vidyasagar-setu/articleshow/127038229.cms"
    }
  ]
}
