{
  "metadata": {
    "fetch_date": "2026-01-24T09:37:40.159886",
    "query": "top news stories from Kolkata and Bengal today",
    "location": "Kolkata",
    "total_articles": 5
  },
  "articles": [
    {
      "headline": "Visitors in wheelchairs face uneven ramp & gate rail accessibility hurdles",
      "summary": "Accessibility issues at the International Kolkata Book Fair are making life harder for visitors in wheelchairs. Uneven ramps and poorly designed gate rails are creating hurdles at the venue. Organizers are being urged to address these oversights promptly.",
      "detailed_summary": "• Visitors in wheelchairs encountered uneven ramps at the book fair\n• Gate rail accessibility was also found lacking and problematic\n• These issues are affecting mobility and safety for persons with disabilities\n• The fair’s infrastructure failed to meet basic accessibility standards\n• Calls have been made for immediate corrective action to ensure inclusivity",
      "why_it_matters": "If you're planning to visit the fair—or know someone who is—this is a reminder that not all of us get to enjoy the fun equally. It’s like planning a party and forgetting to invite half the guests. Fixing this isn’t just polite—it’s basic human decency.",
      "context": null,
      "sentiment": "Negative",
      "source": "https://timesofindia.indiatimes.com/city/kolkata/visitors-in-wheelchairs-face-uneven-ramp-gate-rail-accessibility-hurdles/articleshow/127314710.cms"
    },
    {
      "headline": "Narohari saves the day for Bengal",
      "summary": "In a dramatic Santosh Trophy Group A match, Bengal clinched a 1–0 win over Uttarakhand thanks to a 97th-minute goal by substitute Narohari Shrestha. The win gives Bengal six points, tying them with Rajasthan at the top of the group on goal difference.",
      "detailed_summary": "• Bengal beat Uttarakhand 1–0 with a last-minute goal in the 97th minute\n• Substitute Narohari Shrestha scored by chesting down and firing into the top-left corner\n• This marks Bengal’s second consecutive win in the group stage\n• Bengal now has 6 points, level with Rajasthan, but trails on goal difference\n• In another match, Assam drew 3–3 with Nagaland",
      "why_it_matters": "For those of you who think football is just kicking a ball around—think again. This win keeps Bengal’s hopes alive and gives local fans bragging rights. Plus, it’s proof that even in the 90th minute, miracles happen—just like finding your keys in the morning.",
      "context": null,
      "sentiment": "Positive",
      "source": "https://timesofindia.indiatimes.com/city/kolkata/narohari-saves-the-day-for-bengal/articleshow/127321838.cms"
    },
    {
      "headline": "EC seeks report from Bengal chief secy on no FIR against 4 officials, gives 72‑hour deadline",
      "summary": "The Election Commission has demanded a report within 72 hours from West Bengal’s Chief Secretary regarding the failure to file FIRs against four officials. This follows concerns over procedural lapses during the SIR process.",
      "detailed_summary": "• ECI has directed the Chief Secretary to submit a report within three days\n• The report must explain why no FIRs were filed against four officials\n• The issue stems from alleged procedural lapses during the Special Intensive Revision (SIR) of electoral rolls\n• The directive underscores the ECI’s concern over accountability\n• This comes amid broader scrutiny of the SIR process in West Bengal",
      "why_it_matters": "If you thought bureaucracy was just paperwork, think again—it can land people in hot water. This is about ensuring those who mess up don’t just get a slap on the wrist. For Kolkata’s working crowd, it’s a reminder that even the invisible gears of governance can affect your vote, your trust, and your patience.",
      "context": null,
      "sentiment": "Neutral",
      "source": "https://indianexpress.com/article/cities/kolkata/ec-seeks-report-from-bengal-chief-secy-on-no-fir-against-4-officials-gives-72-hour-deadline-10487907/lite/"
    },
    {
      "headline": "JP Nadda Says Bengali Community Unsafe in West Bengal, Calls for Change",
      "summary": "Union Minister JP Nadda claimed that the Bengali community is not safe in West Bengal and called for the state to be “rescued” from its troubles. His remarks have sparked political controversy.",
      "detailed_summary": "• JP Nadda stated that Bengalis are not safe in their own state\n• He called for urgent change to “rescue” West Bengal from its current state\n• The comments have ignited political debate and backlash\n• The statement comes amid escalating tensions over governance and security\n• No specific incidents were cited to substantiate the safety concerns",
      "why_it_matters": "If you’re from Bengal, hearing that your own safety is up for debate is like being told your own home is haunted. Whether it’s political hyperbole or a genuine concern, it’s bound to ruffle feathers—and maybe even affect how safe you feel walking down Park Street at night.",
      "context": null,
      "sentiment": "Negative",
      "source": "https://dailypioneer.com/news/bengalis-not-safe-in-bengal-time-has-come-for-change-jp-nadda"
    },
    {
      "headline": "Bengal: CM asks Centre to take responsibility for 'deaths' during SIR, slams ECI over 'logical discrepancies'",
      "summary": "On Netaji Subhas Chandra Bose’s 129th birth anniversary, CM Mamata Banerjee blamed the Centre for deaths linked to the SIR process and criticized the ECI over “logical discrepancies” affecting 1.38 crore voters. She demanded the publication of names and better handling of the process.",
      "detailed_summary": "• CM Mamata Banerjee accused the Centre of responsibility for deaths during the SIR exercise\n• She highlighted that 1.38 crore names were flagged under “logical discrepancy”\n• She cited an instance of a 90-year-old woman attending a hearing in an ambulance on oxygen\n• She demanded that the names be displayed publicly in Gram Panchayat Bhawans, block offices, and ward offices by January 24\n• Her remarks were made during a public event commemorating Netaji’s 129th birth anniversary",
      "why_it_matters": "If you’re wondering why your vote might vanish into thin air, this is your answer. When 1.38 crore people are flagged for “logical discrepancies,” it’s like the system is playing hide-and-seek with democracy. And if a 90-year-old needs oxygen to prove her identity, something’s gone seriously sideways.",
      "context": "Special Intensive Revision (SIR): A voter roll update exercise by the Election Commission aimed at verifying and correcting electoral rolls. It categorizes entries into mapped, unmapped, and logical discrepancies—such as mismatched parent names or age differences. The process has been criticized for causing anxiety and procedural confusion.  \n   Logical Discrepancy: A term used in the SIR process to flag entries where details like parent names, ages, or relationships don’t align logically. For example, a child listed as being born only 15 years after a parent. While intended to ensure accuracy, it can inadvertently disenfranchise legitimate voters, especially in regions with non-standard record-keeping.",
      "sentiment": "Negative",
      "source": "https://news.webindia123.com/news/Articles/India/20260123/4408044.html"
    }
  ]
}
