{
  "metadata": {
    "fetch_date": "2026-01-23T19:56:15.956397",
    "query": "top news stories from Kolkata and Bengal today",
    "location": "Kolkata",
    "total_articles": 10
  },
  "articles": [
    {
      "headline": "Nipah virus outbreak: 100 people quarantined in West Bengal to contain deadly zoonotic virus",
      "summary": "Health authorities in West Bengal have quarantined nearly 100 individuals following confirmation of five Nipah virus cases, including two critically ill nurses in Kolkata. The virus, known for its high fatality rate, spreads from animals to humans and through human-to-human transmission. Symptoms include fever, headache, respiratory issues, and encephalitis; treatment is supportive only. Authorities are urgently working to contain the outbreak.",
      "detailed_summary": "• Five confirmed Nipah virus cases in West Bengal, including two nurses in coma and a doctor and health staff member\n• Nearly 100 individuals quarantined to prevent further spread\n• Nipah virus has high fatality rate and spreads zoonotically and via human contact\n• Symptoms include fever, headache, drowsiness, respiratory distress, and brain swelling\n• No specific antiviral treatment exists; supportive care is primary approach",
      "context": "Nipah virus – A zoonotic virus first identified in 1999 in Malaysia, known for causing severe respiratory illness and encephalitis in humans, with mortality rates up to 75%. Outbreaks have occurred in South and Southeast Asia, requiring rapid containment and supportive medical care.",
      "sentiment": "Negative",
      "source": "https://m.economictimes.com/news/new-updates/nipah-virus-outbreak-100-people-quarantined-in-west-bengal-to-contain-deadly-zoonotic-virus-with-high-fatality-check-signs-symptoms-and-treatment/articleshow/127254288.cms"
    },
    {
      "headline": "From SIR to pollution, current affairs enter Saraswati Puja pandals as themes",
      "summary": "During the 2026 Saraswati Puja in Kolkata, educational institutions incorporated contemporary social and political themes into their pandal decorations. Ballygunge Science College highlighted the controversial SIR process, Scottish Church Collegiate School focused on pollution control, and Jadavpur Vidyapith celebrated women’s empowerment. Other schools paid tribute to filmmaker Ritwik Ghatak and showcased Kolkata’s urban evolution.",
      "detailed_summary": "• Ballygunge Science College depicted the SIR process with symbolic elements like a black hole and hanging ropes\n• Scottish Church Collegiate School promoted pollution control and plantation through creative artwork\n• Jadavpur Vidyapith emphasized women’s empowerment and achievements\n• Hindu School honored filmmaker Ritwik Ghatak’s centenary via Patachitra art\n• Bhawanipur Mitra Institution showcased Kolkata’s transformation into a modern metropolis",
      "context": "Saraswati Puja – A Hindu festival celebrating the goddess of learning, Saraswati. Widely observed in West Bengal, especially in educational institutions, where students worship books and knowledge. Pandals often reflect cultural and social themes.",
      "sentiment": "Positive",
      "source": "https://timesofindia.indiatimes.com/city/kolkata/from-sir-to-pollution-current-affairs-enter-saraswati-puja-pandals-as-themes/articleshow/127183679.cms"
    },
    {
      "headline": "R-Day flyers told to reach airport early for checks",
      "summary": "Ahead of Republic Day, Kolkata airport has ramped up security, advising passengers to arrive significantly earlier due to enhanced screening. Two layers of security checks have been introduced, increasing average waiting times by 15–20 minutes. Domestic travelers are advised to arrive three hours before departure, and international travelers four hours early.",
      "detailed_summary": "• Enhanced security at Kolkata airport for Republic Day\n• Two layers of screening: at entrance and before boarding gates\n• Average waiting time increased by 15–20 minutes\n• Domestic passengers advised to arrive three hours early\n• International travelers advised to arrive four hours early",
      "context": "Republic Day – Celebrated on January 26 in India, marking the adoption of the Constitution in 1950. Airports typically increase security measures during national holidays due to higher travel volumes and heightened vigilance.",
      "sentiment": "Neutral",
      "source": "https://timesofindia.indiatimes.com/city/kolkata/r-day-flyers-told-to-reach-airport-early-for-checks/articleshow/127184238.cms"
    },
    {
      "headline": "For 3rd time in Jan, North-South Kolkata Metro ops hit due to tech snag",
      "summary": "The North-South Blue Line of Kolkata Metro experienced its third operational disruption in January, with the latest incident on January 22 causing a 42-minute service suspension. The first train stalled at Rabindra Sadan, affecting commuters. Services resumed by 8:17 AM, with truncated operations on certain stretches. Previous disruptions occurred on January 5 and 13.",
      "detailed_summary": "• Third disruption in January for North-South Blue Line occurred on January 22\n• First train stalled at Rabindra Sadan, suspending services for 42 minutes between Maidan and Tollygunge\n• Hundreds of commuters stranded, including office-goers and students\n• Services operated on truncated stretches: Maidan–Dakshineswar and Mahanayak Uttam Kumar–Shahid Khudiram\n• Normal operations resumed by 8:17 AM",
      "context": "Kolkata Metro – India’s oldest metro system, operational since 1984. The North-South Blue Line is a major commuter corridor. Technical disruptions can significantly impact daily travel in the densely populated city.",
      "sentiment": "Negative",
      "source": "https://timesofindia.indiatimes.com/city/kolkata/for-3rd-time-in-jan-north-south-kolkata-metro-ops-hit-due-to-tech-snag/articleshow/127185885.cms"
    },
    {
      "headline": "16-hour Setu shutdown for repairs on Sun",
      "summary": "Vidyasagar Setu in Kolkata will be closed to vehicular traffic for 16 hours on Sunday (5 am to 9 pm) for essential repairs, including replacement of cables and bearings. The 33-year-old bridge is undergoing a broader rehabilitation by HRBC. Traffic diversions will be implemented during the closure.",
      "detailed_summary": "• Vidyasagar Setu to be closed for 16 hours on Sunday (5 am–9 pm)\n• Repairs include replacement of stay and holding-down cables and bearings\n• Part of comprehensive rehabilitation of the 33-year-old bridge by HRBC\n• Traffic diversions to be managed by Kolkata Police via alternate routes\n• Further closures expected before full rehabilitation is complete",
      "context": "Vidyasagar Setu – Also known as the Second Hooghly Bridge, it is a key cable-stayed bridge in Kolkata, opened in 1992. It connects Howrah and Kolkata and is vital for daily traffic flow.",
      "sentiment": "Neutral",
      "source": "https://timesofindia.indiatimes.com/city/kolkata/16-hour-setu-shutdown-for-repairs-on-sun/articleshow/127184107.cms"
    },
    {
      "headline": "2 Bengal migrant workers found dead in AP, Kerala",
      "summary": "Two migrant workers from West Bengal were found dead in Andhra Pradesh and Kerala within 24 hours. Manjur Alam Laskar, 32, from South 24 Parganas, was killed after a ransom demand; his family suspects targeting due to his identity. Alamgir Alam, 29, from Malda, was found dead near a Chennai railway track; his family suspects foul play. Both families demand thorough investigations.",
      "detailed_summary": "• Manjur Alam Laskar (32) found dead in Andhra Pradesh after ransom demand of Rs 25,000; family transferred Rs 6,000\n• Family alleges he was targeted for being a Bengali-speaking Muslim and suspected to be Bangladeshi\n• Alamgir Alam (29) from Malda found dead near a Chennai railway track; last contacted wife on January 14\n• Family suspects murder and demands investigation\n• Both cases occurred within 24 hours, raising concerns over migrant worker safety",
      "context": "Migrant workers – Many from West Bengal work in other Indian states under challenging conditions. Incidents of violence or suspicious deaths highlight vulnerabilities and the need for better protection and support systems.",
      "sentiment": "Negative",
      "source": "https://timesofindia.indiatimes.com/city/kolkata/2-bengal-migrant-workers-found-dead-in-ap-kerala/articleshow/127191972.cms"
    },
    {
      "headline": "Chingrighata night traffic block trial for Metro work starts",
      "summary": "Kolkata Traffic Police have begun night traffic trials at Chingrighata to collect data ahead of planned weekend night closures in February for Metro viaduct construction. A new slip road has been created, and trials are conducted in two time slots. A traffic post at Majherpara has also been established to aid management.",
      "detailed_summary": "• Night traffic trials initiated at Chingrighata for Metro viaduct construction planning\n• Slip road created near Captain Bhery connecting flyover to Beliaghata Canal Road and EM Bypass\n• Trials conducted in morning (8–11:30 am) and evening (5–8:30 pm) slots\n• New traffic post set up at Majherpara, funded by Metro authorities\n• Trials aim to familiarize motorists and adjust signal cycles before February closures",
      "context": "Metro expansion – Kolkata Metro is undergoing expansion, requiring construction of viaducts. Traffic trials help plan diversions and minimize disruption during construction.",
      "sentiment": "Neutral",
      "source": "https://timesofindia.indiatimes.com/city/kolkata/chingrighata-night-traffic-block-trial-for-metro-work-starts/articleshow/127185245.cms"
    },
    {
      "headline": "864 call records help nab murder accused",
      "summary": "Kolkata police arrested the main accused, Nur, and accomplice Nazmul in the murder of 38-year-old Rinku Samaddar, using analysis of 864 call records. Rinku had called her husband from Nur’s phone before her death. CCTV footage traced their movements, leading to the arrest. The accused were not professional criminals.",
      "detailed_summary": "• Police analyzed 864 call records, narrowed to 40 key numbers, leading to arrest of Nur and Nazmul\n• Rinku called her husband from Nur’s phone instructing him not to search for her\n• CCTV tracked movements from Santragachhi to Brace Bridge station\n• Nur bought a knife, walked with Rinku along tracks, killed her, fled without taking anything\n• Accused were not professional criminals; Nur reportedly under psychological pressure",
      "context": "Criminal investigation – Use of call data records (CDRs) and CCTV footage is a common investigative tool in Indian law enforcement to trace suspects and reconstruct crime events.",
      "sentiment": "Neutral",
      "source": "https://timesofindia.indiatimes.com/city/kolkata/864-call-records-help-nab-murder-accused/articleshow/127184129.cms"
    },
    {
      "headline": "From football to literature: Bonds that bind Argentina & West Bengal",
      "summary": "The cultural connection between Argentina and West Bengal is highlighted through shared passions for football and literature. Argentine Ambassador Mariano A. Caucino noted the admiration for Rabindranath Tagore in Argentina and the fervent football culture in both regions. The article underscores how sports and literature foster international ties.",
      "detailed_summary": "• Cultural ties between Argentina and West Bengal span football and literature\n• Argentine Ambassador Mariano A. Caucino emphasized shared passions\n• Football holds a special place in both Argentine and Bengali hearts\n• Rabindranath Tagore’s works are deeply respected in Argentina\n• Cultural exchange showcases how sports and literature transcend borders",
      "context": "Rabindranath Tagore – Nobel laureate poet from Bengal whose literary works have global influence. Football – A major sport in both Argentina and West Bengal, with passionate fan cultures.",
      "sentiment": "Positive",
      "source": "https://m.economictimes.com/news/india/from-football-to-literature-bonds-that-bind-argentina-west-bengal/articleshow/127243761.cms"
    },
    {
      "headline": "JEE Main 2026 Jan 23 Exam Postponed in West Bengal, Saraswati Puja Date Clash",
      "summary": "The National Testing Agency (NTA) has postponed the January 23 JEE Main exam for West Bengal candidates due to a clash with Saraswati Puja celebrations. Affected students will receive revised dates and updated admit cards."
    }
  ]
}
