{
  "metadata": {
    "fetch_date": "2026-01-24T09:45:17.851130",
    "query": "top news stories from Kolkata and Bengal today",
    "location": "Kolkata",
    "total_articles": 10
  },
  "articles": [
    {
      "headline": "Bengal pacers destroy Services",
      "summary": "On Day 2 of the Ranji Trophy Elite Group C match at Kalyani, Bengal’s bowlers decimated Services, who were 126 for 8 and trailing by 393 runs. Suraj Sindhu Jaiswal and Akash Deep took three wickets each, while Mohammed Shami claimed two. Bengal’s earlier batting effort featured Sudip Chatterjee’s maiden double century (209) and Shakir Habib Gandhi’s 91.",
      "detailed_summary": "• Services were 126 for 8, trailing Bengal by 393 runs\n• Suraj Sindhu Jaiswal and Akash Deep took three wickets each\n• Mohammed Shami added two wickets to the tally\n• Sudip Chatterjee scored 209 off 327 balls—his maiden double century\n• Shakir Habib Gandhi contributed 91 runs as wicketkeeper‑batter",
      "why_it_matters": "For those who think cricket is just tea breaks and chatter, Bengal’s bowlers just turned the script into a thriller. A dominant performance like this boosts regional pride and could mean more cricket fever in cafés and offices across Kolkata. Plus, if you’re a young cricketer, this is the kind of match that makes you dream big.",
      "context": null,
      "sentiment": "Positive",
      "source": "https://timesofindia.indiatimes.com/city/kolkata/bengal-pacers-destroy-services/articleshow/127321527.cms"
    },
    {
      "headline": "1st day, 1st show: Crowd takes over book fair with record 2.5L footfall",
      "summary": "The 49th International Kolkata Book Fair opened with a record-breaking 2.5 lakh visitors on its first day—the highest ever. The four-day holiday weekend, including Saraswati Puja and Republic Day, and improved metro access contributed to the surge. The fair runs until February 3.",
      "detailed_summary": "• Opening day footfall reached 2.5 lakh visitors\n• The record is attributed to a rare four‑day holiday weekend\n• Enhanced metro connectivity from Howrah aided attendance\n• In 2025, the fair saw 27 lakh visitors and ₹23 crore in sales\n• Attendees included schoolchildren, students, families, many in traditional attire",
      "why_it_matters": "If you thought your weekend was packed, imagine 2.5 lakh book lovers swarming the fair. It’s a literary carnival that boosts local businesses, gives students a chance to snag bargains, and offers a festive vibe that even your aunt will Instagram. And hey, if you’re hunting for a good read, this is your paradise.",
      "context": null,
      "sentiment": "Positive",
      "source": "https://timesofindia.indiatimes.com/city/kolkata/1st-day-1st-show-crowd-takes-over-book-fair-with-record-2-5l-footfall/articleshow/127314598.cms"
    },
    {
      "headline": "Winter windfall for city eateries as Jan footfall smashes last yr's record",
      "summary": "Kolkata’s food and beverage sector saw a 10% rise in footfall in January compared to last year, thanks to cold weather and festive events. Popular spots like Mocambo and Peter Cat reported long queues, while specialty restaurants saw a 5% business increase.",
      "detailed_summary": "• Restaurant and bar footfall up ~10% year‑on‑year in January\n• Cold weather and extended festive period drove the surge\n• Park Street venues like Mocambo, Peter Cat, Kwality were particularly busy\n• Specialty Restaurants reported a 5% rise in business\n• Some eateries hosted kebab festivals and curated menus to attract crowds",
      "why_it_matters": "If your stomach has a social life, it’s thriving this January. More footfall means more jobs, livelier nights, and more excuses to try that kebab festival you’ve been eyeing. For anyone who loves food or works in hospitality, this is the kind of boom that keeps the city buzzing—and your belly happy.",
      "context": null,
      "sentiment": "Positive",
      "source": "https://timesofindia.indiatimes.com/city/kolkata/winter-windfall-for-city-eateries-as-jan-footfall-smashes-last-yrs-record/articleshow/127320599.cms"
    },
    {
      "headline": "Rudrajit Roy earns directorial honour at Third Eye Asian Film Festival",
      "summary": "Kolkata filmmaker Rudrajit Roy received the Best Director (Special Jury Mention) award in the Indian Cinema Competition at the 22nd Third Eye Asian Film Festival. He is the only director from West Bengal to be honoured at the event.",
      "detailed_summary": "• Rudrajit Roy won Best Director (Special Jury Mention)\n• Award presented at the 22nd Third Eye Asian Film Festival\n• Category: Indian Cinema Competition\n• Roy is the only West Bengal director to receive recognition this year\n• The accolade highlights regional cinema on an Asian platform",
      "why_it_matters": "If you thought Kolkata was just about adda and mishti, here’s a reminder that our filmmakers are making waves beyond the Hooghly. This award puts Bengal on the cinematic map and might just inspire your next Netflix binge—or your cousin’s film school dreams.",
      "context": null,
      "sentiment": "Positive",
      "source": "https://timesofindia.indiatimes.com/entertainment/rudrajit-roy-earns-directorial-honour-at-third-eye-asian-film-festival/articleshow/127254952.cms"
    },
    {
      "headline": "Mobile apps to expand breast cancer outreach and care launched in Kolkata",
      "summary": "The Institute of Breast Disease in Kolkata launched two mobile apps to enhance breast cancer awareness, early detection, and treatment adherence. The apps were inaugurated by Dr. Swapan Saren and attended by the Principal Secretary (Education), Binod Kumar.",
      "detailed_summary": "• Two mobile applications launched to support breast cancer outreach\n• Focus areas: awareness, early detection, treatment adherence\n• Initiative by the Institute of Breast Disease, Kolkata\n• Launched by Dr. Swapan Saren, Director of Health Services, West Bengal\n• Principal Secretary (Education) Binod Kumar was present at the event",
      "why_it_matters": "If your phone can order food, why not help save lives? These apps are a tech lifeline for women across Bengal—making health advice and reminders as easy as scrolling through memes. It’s a small digital nudge that could make a big difference in early detection and treatment.",
      "context": null,
      "sentiment": "Positive",
      "source": "https://timesofindia.indiatimes.com/city/kolkata/mobile-apps-to-expand-breast-cancer-outreach-and-care-launched-in-kolkata/articleshow/127269387.cms"
    },
    {
      "headline": "Bengal SIR: EC orders FIRs against negligent BLOs, warns DEOs on law and order",
      "summary": "The Election Commission has directed FIRs against negligent Booth Level Officers during the Special Summary Revision (SIR) process and warned District Election Officers to maintain law and order. The directive applies nationwide, including West Bengal.",
      "detailed_summary": "• EC mandates FIRs against negligent BLOs during SIR\n• Applies across all states and UTs, including West Bengal\n• DEOs warned to ensure law and order during the revision process\n• Aim is to ensure transparency and smooth electoral operations\n• Part of broader SIR oversight measures by the EC",
      "why_it_matters": "If you’ve ever wondered whether your vote counts, the EC just made sure it does—by cracking down on sloppy officials. It’s like your polling booth got a stern talking-to. For voters in Bengal, this means fewer hiccups and maybe fewer headaches when you go to cast your ballot.",
      "context": null,
      "sentiment": "Neutral",
      "source": "https://m.economictimes.com/news/elections/assembly-elections/west-bengal/bengal-sir-ec-orders-firs-against-negligent-blos-warns-deos-on-law-and-order/articleshow/127309302.cms"
    },
    {
      "headline": "Adjourn West Bengal SIR hearing, file FIR if attacked: CEO",
      "summary": "West Bengal’s Chief Electoral Officer instructed district magistrates and DEOs to adjourn SIR hearings if violence occurs and to file FIRs immediately in case of threats or property damage. The move aims to safeguard the integrity of the hearing process.",
      "detailed_summary": "• CEO instructed adjournment of SIR hearings if violence occurs\n• FIRs must be filed immediately for threats or property damage\n• Applies to hearings at panchayat, block, or ward offices\n• Directive issued to district magistrates and DEOs\n• Goal is to maintain peace and security during sensitive electoral hearings",
      "why_it_matters": "If you thought electoral hearings were dull, think again—this one comes with a side of drama. The CEO’s orders are like a safety net for democracy, ensuring that even if things get heated, the process doesn’t go up in flames. For citizens, it means safer, more reliable voter verification.",
      "context": null,
      "sentiment": "Neutral",
      "source": "https://timesofindia.indiatimes.com/india/adjourn-wb-sir-hearing-file-fir-if-attacked-ceo/articleshow/127335819.cms"
    },
    {
      "headline": "ED chief Rahul Navin reviews Bengal probes, I‑PAC coal case in focus",
      "summary": "Enforcement Directorate Director Rahul Navin visited Kolkata to review ongoing investigations in West Bengal, with a particular focus on the I‑PAC coal smuggling case. The visit underscores heightened federal scrutiny of regional financial and corruption matters.",
      "detailed_summary": "• ED Director Rahul Navin visited Kolkata on Friday\n• Reviewed progress of multiple ongoing investigations in West Bengal\n• Focused on the I‑PAC coal smuggling case\n• Meetings held with senior officials in the region\n• Signals increased federal attention on high‑profile cases in Bengal",
      "why_it_matters": "If you’ve ever wondered what happens when politics and coal collide, here’s your answer: the ED shows up. This visit means that the bigwigs are watching—and maybe sweating. For citizens, it’s a reminder that corruption isn’t just a headline—it can affect governance, budgets, and even your local services.",
      "context": null,
      "sentiment": "Neutral",
      "source": "https://m.economictimes.com/news/india/ed-chief-rahul-navin-reviews-bengal-probes-i-pac-coal-case-in-focus/articleshow/127317906.cms"
    },
    {
      "headline": "Kolkata traffic advisory for Republic Day 2026: Several roads closed on Jan 24 & 26 – check alternate routes",
      "summary": "Kolkata Police announced road closures and traffic diversions for the Republic Day rehearsal on January 24 and the parade on January 26. Key roads like Red Road, Hospital Road, and Queensway will be closed, with goods vehicle restrictions and alternate routes specified.",
      "detailed_summary": "• Roads closed on January 24 from 6:30 am to 12:00 noon for rehearsal: Hospital Road, Lovers Lane, Queensway, Casuarina Avenue, Plassey Gate Road, Khidderpore Road, Red Road, Gosthapal Sarani, R.R. Avenue (southern flank)\n• Goods vehicles banned on St. George’s Gate Road, Strand Road, and approach roads during military movements\n• Traffic diversions include routes via AJC Bose Road, Strand Road, Cathedral Road, J.L. Nehru Road, Guru Nanak Sarani\n• On January 26, Red Road closed from 10:00 pm on Jan 25 until parade ends; goods vehicle restrictions from 5:30 am to 1:00 pm on key roads\n• Parking prohibited on multiple roads including R.R. Avenue, Government Place West, Chowringhee Road, J.L. Nehru Road, Cathedral Road, Strand Road, Queensway, Outram Road",
      "why_it_matters": "If you thought your morning commute was predictable, think again—Kolkata’s about to play traffic Tetris. Whether you’re heading to work or just trying to avoid honking chaos, this advisory is your survival guide. Plan ahead, or risk becoming part of the parade yourself—on foot.",
      "context": null,
      "sentiment": "Neutral",
      "source": "https://indianexpress.com/article/cities/kolkata/republic-day-2026-kolkata-traffic-advisory-roads-closed-jan-26-10479402/"
    },
    {
      "headline": "Hok Kolorob film released in theatres across West Bengal",
      "summary": "The Bengali socio‑vigilante thriller film \"Hok Kolorob,\" directed by Raj Chakraborty, was released on January 23, 2026. The film addresses the issue of ragging and stars Saswata Chatterjee as Inspector Khudiram Chaki.",
      "detailed_summary": "• \"Hok Kolorob\" released theatrically on January 23, 2026\n• Directed by Raj Chakraborty, produced by Subhashree Ganguly\n• Socio‑vigilante thriller focusing on ragging aftermath\n• Lead actor: Saswata Chatterjee as Inspector Khudiram Chaki\n• Runtime: 131 minutes; distributed by PVR Inox Pictures",
      "why_it_matters": "If you’ve ever sat through a college orientation and cringed at the ragging stories, here’s your catharsis. A homegrown thriller tackling a serious issue—plus, it’s Raj Chakraborty, so expect drama, action, and maybe a tear or two. Perfect for a weekend outing that’s more than just popcorn.",
      "context": null,
      "sentiment": "Neutral",
      "source": "https://en.wikipedia.org/wiki/Hok_Kolorob_%28film%29"
    }
  ]
}
