{
  "metadata": {
    "fetch_date": "2026-01-24T11:01:12.888018",
    "query": "weird, bizarre, funny, quirky, and unusual news stories from India in the last week",
    "location": "Global",
    "total_articles": 5,
    "news_type": "quirky"
  },
  "articles": [
    {
      "headline": "Bengaluru to host citywide “Happpy AiR Parade” on January 25",
      "summary": "Bengaluru is gearing up for a citywide “Happpy AiR Parade” organized by Happpy AiR in collaboration with the Traffic Police to promote mental well-being. The parade promises a lively, uplifting atmosphere aimed at spreading joy and awareness. Citizens are encouraged to join in the fun and positivity.",
      "detailed_summary": "• The parade is scheduled for January 25 across Bengaluru’s streets\n• Organized by Happpy AiR in partnership with Bengaluru Traffic Police\n• Aims to spread joy and raise awareness about mental health and emotional well-being\n• Citizens can expect a festive, uplifting atmosphere throughout the city\n• Emphasizes community engagement and positivity in urban life",
      "why_it_matters": "Because who says parades are only for festivals? Sometimes you just need a citywide dose of happiness to remind yourself that Mondays aren’t the only things that can be bright.",
      "context": null,
      "sentiment": "Positive",
      "source": "https://timesofindia.indiatimes.com/speaking-tree/daily-ecstasy/bengaluru-to-witness-a-citywide-happpiness-parade-on-january-25/articleshow/127350597.cms"
    },
    {
      "headline": "Chandigarh logs warmest January day in 14 years at 26.3 °C",
      "summary": "On January 22, Chandigarh recorded a sweltering 26.3 °C—the hottest January day since 2012—surpassing the previous record of 25.8 °C from 2021. The spike was attributed to clear skies, strong sunshine, and westerly winds. Just two weeks earlier, the city had experienced its coldest day of the season.",
      "detailed_summary": "• Maximum temperature hit 26.3 °C on January 22, 2026\n• This is 8 °C above the seasonal norm and the highest January temperature since 2012\n• Previous record was 25.8 °C on January 5, 2021\n• Ironically, on January 4, the city recorded its coldest day of the season with a max of only 12 °C\n• Nights remained cold, with a minimum of 4.8 °C—3 °C below normal",
      "why_it_matters": "Because Chandigarh just proved that winter can have mood swings too—one day you're shivering, the next you're sunbathing in January.",
      "context": null,
      "sentiment": "Positive",
      "source": "https://timesofindia.indiatimes.com/city/chandigarh/chandigarh-logs-warmest-january-day-in-14-years-at-26-3c/articleshow/127201312.cms"
    },
    {
      "headline": "Chandigarh wakes to wettest January day since 2022 after sunny spell",
      "summary": "Following its record-breaking warmth, Chandigarh experienced its wettest January day since 2022 on January 24, with 38.3 mm of rain. Temperatures plummeted by nearly 13 °C, and strong winds accompanied the downpour. The abrupt shift was linked to an active western disturbance.",
      "detailed_summary": "• Rainfall totaled 38.3 mm in a single day—the highest January rainfall since 2022\n• Maximum temperature dropped by 12.8 °C to 13.5 °C\n• Rain began late Thursday night and continued through Friday\n• Gusty winds reached up to 60 km/h\n• The weather shift was attributed to an active western disturbance",
      "why_it_matters": "Because Chandigarh just gave us a masterclass in weather whiplash—sunny one day, soggy the next. Mother Nature’s version of a plot twist.",
      "context": null,
      "sentiment": "Positive",
      "source": "https://timesofindia.indiatimes.com/city/chandigarh/after-sunny-spell-chandigarh-wakes-to-wettest-january-day-since-2022/articleshow/127323180.cms"
    },
    {
      "headline": "Chandigarh left powerless as storm slams city, 182 breakdowns recorded",
      "summary": "A fierce storm battered Chandigarh, causing power outages lasting 12–14 hours across many sectors. The storm led to 182 electrical breakdowns, 34 transient faults, and 37 damaged poles. Residents expressed outrage over the prolonged outages despite prior weather warnings.",
      "detailed_summary": "• Storm caused electricity outages lasting 12–14 hours in many areas\n• Recorded 182 breakdowns and 34 transient faults across 11kV, 33kV, and 66kV feeders\n• 37 electric poles were damaged due to fallen trees and mechanical stress\n• Residents criticized the slow restoration despite weather forecasts\n• Power teams worked through the storm to restore supply, though some areas remained offline at reporting time",
      "why_it_matters": "Because nothing says “winter drama” like a blackout—Chandigarh just turned its power grid into a suspense thriller.",
      "context": null,
      "sentiment": "Positive",
      "source": "https://timesofindia.indiatimes.com/city/chandigarh/slammed-by-storm-chandigarh-left-powerless/articleshow/127322908.cms"
    },
    {
      "headline": "Region rocked by fierce rain, hail, thunderstorms across northwest India",
      "summary": "A severe weather event swept across Punjab, Haryana, Himachal Pradesh, and Chandigarh, bringing torrential rain, hail, thunderstorms, and snowfall. Punjab saw a staggering 1,375% excess rainfall, while Himachal experienced winds up to 87 km/h and snow in higher altitudes. Dense fog and cold wave conditions are forecast to continue.",
      "detailed_summary": "• Punjab recorded 1,375% excess rainfall, with Gurdaspur receiving 40 mm\n• Haryana and Himachal saw 592% and 103% excess rain respectively\n• Himachal’s hilly regions experienced winds up to 87 km/h and snowfall in areas like Shimla and Keylong\n• Chandigarh and nearby cities also faced gusty winds and abrupt thermal shifts\n• Forecasts predict dense fog, cold wave pockets, and another wet spell with rain and snow from January 27–28",
      "why_it_matters": "Because when the skies decide to throw everything at you—rain, hail, snow, wind—you know Mother Nature is just showing off.",
      "context": null,
      "sentiment": "Positive",
      "source": "https://timesofindia.indiatimes.com/city/chandigarh/region-rocked-by-fierce-rain-hail-thunderstorms/articleshow/127320360.cms"
    }
  ]
}